{
  "mobs": [
    {
      "name": "chicken",
      "type": "passive",
      "hitPoints":  4,
      "spawn": [
        "Chickens spawn naturally in the overworld.",
        "Chickens are more common in jungle biomes.",
        "5% of chickens spawn as babies.",
        "Chickens require a light level of 7 or more and are found in groups of 2 to 4."
      ],
      "drops": [
        "0-2 feathers. The maximum is increased by 1 per level of Looting.",
        "1 raw chicken (1 cooked chicken if killed while on fire). The maximum is increased by 1 per level of Looting.",
        "1-3 exp when killed by a player of tamed wolf.",
        "Chickens lay 1 egg every 5 to 10 minutes.",
        "When they breed they drop 1-7 exp.",
        "Killing a baby chicken yields no items or exp."
      ],
      "behavior": [
        "Chickens actively run around and chicks follow adults.",
        "When falling they flap their wings and fall slowly; they are immune to fall damage.",
        "When attacked or harmed they flee.",
        "Chickens uniquely attempt to jump up to climb stairs instead of climbing them normally.",
        "Chickens follow players holding various seeds.",
        "A chicken lays an egg every 5-10 minutes for loaded chunks.",
        "If two adult chickens are fed wheat seeds, beetroot seeds, melon seeds or pumpkin seeds, a baby spawns.",
        "When throwing eggs at the ground, there's a 1 in 8 chance to spawn a chick."
      ]
    },
    {
      "name": "cow",
      "type": "passive",
      "hitPoints": 10,
      "spawn": [
        "Cows spawn naturally in the overworld.",
        "Cow spawn in herds of 2 to 3.",
        "Cows require grassblocks and a light level of 9 or higher.",
        "Cows require at least 2 blocks of space above.",
        "A singular cow spawns inside fowl runs and butchers' houses in villagers.",
        "After world generation, cows spawn individually.",
        "Shearing a mooshroom \"spawns\" a cow.",
        "5% of cows spawn as calves."
      ],
      "drops": [
        "0-2 leather. The maximum is increased by 1 per level of Looting.",
        "1-3 raw beef (steak if killed while on fire). The maximum is increased by 1 per level of Looting",
        "1-3 experience when killed by a player or tamed wolf.",
        "Killing a baby cow yields no items nor experience."
      ],
      "behavior": [
        "Cows wander around, mooing occasionally.",
        "Cows can be milked by using a bucket on it, yielding a milk bucket.",
        "Baby cows follow adult cows.",
        "A cow follows a player who holds wheat. Two adult cows given wheat enter love mode and create calves."
      ]
    },
    {
      "name": "horse",
      "type": "passive",
      "hitPoints": 15,
      "spawn": [
        "Horses spawn in plains and savannas in herds of 2-6.",
        "All combinations of color and markings are equally likely.",
        "All members of the herd have the same color, but markings may vary.",
        "20% of individual horses spawn as foals.",
        "Villages can generate naturally with stables and pens containing horses."
      ],
      "drops": [
        "0-2 Leather. The maximum amount is increased by 1 per level of Looting.",
        "1-3 exp when killed by a player or tamed wolf.",
        "Horse armor if the horse was already equipped with it.",
        "Saddle if the horse was already equipped with it."
      ],
      "behavior": [
        "Horses wander aimlessly, occasionally eating or flicking their tails.",
        "Any horse can be attached to a lead without protest.",
        "Horses remain passive even when hit. They slowly regenerate health.",
        "You must tame a horse in order to breed it, control it, and give it equipment.",
        "A player tames an adult horse by repeatedly mounting it until the horse stops bucking them off.",
        "Feeding two tamed horses golden apples or golden carrots activates love mode, causing them to mate and produce a foal."
      ]
    },
    {
      "name": "mooshroom",
      "type": "passive",
      "hitPoints": 10,
      "spawn": [
        "Mooshrooms are mushroom-covered variants of cows exclusive to mushroom-fields biome.",
        "Red mooshrooms can spawn in herds of 4-8 when the light level is 9 or higher and on Mycelium.",
        "Mooshrooms do not naturally spawn in any other biome and brown mooshrooms never spawn naturally."
      ],
      "drops": [
        "0-2 leather. The maximum amount is increased by 1 per level of Looting.",
        "1-3 Raw Beef (Steak if killed while on fire). The maximum amount is increased by 1 per level of Looting.",
        "1-3 exp when killed by a player or tamed wolf.",
        "Shearing a mooshroom drops 5 corresponding mushrooms and turns the mooshroom into a normal cow indefinitely.",
        "Using a bucket on a mooshroom will yield a milk bucket. Using a bowl will yield mushroom stew."
      ],
      "behavior": [
        "Mooshrooms walk around slowly and aimlessly, avoiding danger such as cliffs, fire or lava.",
        "A mooshroom follows a player holding wheat.",
        "A red mooshroom transforms into a brown mooshroom (and vice versa) when it is struck by lightning."
      ]
    },
    {
      "name": "pig",
      "type": "passive",
      "hitPoints": 10,
      "spawn": [
        "Pigs spawn in groups of 1-4.",
        "Spawn on grassy blocks in lit areas (level >= 7).",
        "They can also be found in villages.",
        "5% of pigs spawn as piglets."
      ],
      "drops": [
        "1-3 raw porkchop (or cooked if killed while on fire).",
        "1 saddle if saddled.",
        "1-3 exp if killed by a player or tamed wolf.",
        "Killing a baby pig yields no items nor exp.",
        "Porkchop drops are increased by 1 per level of Looting."
      ],
      "behavior": [
        "Pigs oink and roam around avoiding hazards.",
        "Pigs flee when attacked or harmed.",
        "When a pig is struck by lightning it transforms into a zombified piglin.",
        "Pigs follow players and breed using carrots, potatoes, and beetroots.",
        "Saddled pigs are controllable with a carrot on a stick."
      ]
    },
    {
      "name": "sheep",
      "type": "passive",
      "hitPoints": 8,
      "spawn": [
        "81.836% of sheep spawn white. There is a 5% chance that a sheep spawns light gray, gray, or black.",
        "3% of sheep spawns are brown and pinks are rare with a 0.164%",
        "Sheep spawn in 2s or 3s on grass blocks at the surface during world generation.",
        "Sheep spawn at light level of 7 or higher with 2 block spaces above.",
        "Sheep do not spawn in snowy tundras and wooded badlands plateaus during world generation.",
        "2 sheep may spawn in shepherd houses, butcher houses, and animal pens in villages."
      ],
      "drops": [
        "1 wool of corresponding color if the sheep has wool.",
        "1-2 raw mutton (cooked mutton if killed while on fire). Maximum amount is increased by 1 per level of looting.",
        "1-3 experience if killed by player or a wolf.",
        "Shearing gives 1-3 wool."
      ],
      "behavior": [
        "Sheep wander aimlessly in small flocks of about 2-4, yet it is not uncommon to see lonely sheep.",
        "Sheep avoid hazards and cliffs that cause damage. If harmed sheep flee for a few seconds.",
        "When a sheared sheep eats a grass block, its wool grows back. The chance of eating grass is 1 in 1000 per game tick.",
        "Sheep will follow a player holding wheat.",
        "You can dye a sheep's wool by pressing the use key while holding any dye."
      ]
    },
    {
      "name": "snowgolem",
      "type": "passive",
      "hitPoints": 4,
      "spawn": [
        "Snow golems do not spawn but rather are created.",
        "To create a snow golem, the player must stack two snow blocks followed by a pumpkin.",
        "The building pattern will also work if placed sideways or upside-down.",
        "Endermen are capable of creating snow golems by placing the necessary blocks, but this is extremely rare."
      ],
      "drops": [
        "Snow golems drop 0-15 snowballs on death."
      ],
      "behavior": [
        "Snow golems do not follow players. They have their own path-finding skills.",
        "Snow golems avoid cacti, fire, lava, and water. They avoid cliffs even though they are immune to fall damage.",
        "Snow golems melt in biomes with a temperature greater than 1.0 i.e. deserts, the Nether.",
        "Shearing a snow golem removes the pumpkin, revealing its face.",
        "Snow golems will melt in rain and water, and will take freezing damage from powder snow.",
        "Snow golems move toward hostile mobs and throw snowballs at them knocking them back.",
        "As snow golems move, they leave a trail of snow on the ground (only in biomes having a temperature less than 0.81)"
      ]
    },
    {
      "name": "squid",
      "type": "passive",
      "hitPoints": 10,
      "spawn": [
        "2-4 squid can spawn in water, as long as the biome is a river or ocean biome and the Y-level is between 46-63.",
        "Squid spawn only on the surface so there must not be a solid block above the spawn location."
      ],
      "drops": [
        "1-3 Ink Sacs. The maximum amount is increased by 1 per level of Looting.",
        "1-3 exp when killed by a player or tamed wolf.",
        "Killing a baby squid yields no items and no exp."
      ],
      "behavior": [
        "Squid are passive toward the player and do not interact with the player.",
        "When a squid moves it tentacles open and close giving it an appearance of pushing itself forward.",
        "Squid suffocate when out of water, dying after 300 game ticks (15 seconds).",
        "Squid remain stationary on land. They behave in lava the same as they do on land.",
        "Squid produce a cloud of black ink particles and swim away when attacked."
      ]
    },
    {
      "name": "turtle",
      "type": "passive",
      "hitPoints": 30,
      "spawn": [
        "Turtles spawn on the sand on beaches with daylight in small groups of up to 5.",
        "10% of turtles spawned are babies.",
        "Turtles spawn at light levels greater than 8 and below 4 blocks above sea level (about 62), on the sand."
      ],
      "drops": [
        "0-2 Seagrass. The maximum amount is increased by 1 per level of Looting.",
        "1-3 exp if killed by a player or tamed wolf.",
        "1 Bowl if killed by lightning.",
        "Baby turtles do not drop anything when they die.",
        "When a baby turtle grows up to an adult it drops 1 Scute."
      ],
      "behavior": [
        "Turtles can move both on land and swim in water. They move slowly on land but can swim fast in water.",
        "They move around aimlessly and flee when attacked. If attacked on land, they generally move toward the nearest water source.",
        "When in an enclosed area they generally swim in circles.",
        "Turtles cannot be attached to leads but can be led by a player holding seagrass.",
        "Turtles remember the block they hatched on as their home beach so no matter how far away the turtle is, it will always try to return to its home beach to lay its eggs.",
        "Feeding two turtles seagrass causes them to enter love mode, causing one of the turtles to have eggs.",
        "Players can move turtle eggs with Silk Touch tools."
      ]
    },
    {
      "name": "villager",
      "type": "passive",
      "hitPoints": 20,
      "spawn": [
        "Villagers can be found in villages which spawn in several biomes.",
        "When a zombie villager is cured, it transforms into a villager."
      ],
      "drops": [
        "Killing villagers does not drop any items or exp. When a villager holds an item to trade, that item is not dropped when killed.",
        "Upon successful trading, 3-6 exp is dropped."
      ],
      "behavior": [
        "They generally wander about the village, making mumbling sounds here and there.",
        "Villagers run inside at night or during rain, closing the doors behind them.",
        "Villagers flee and sprint away from hostile mobs or when attacked.",
        "A villager is never prone to despawning.",
        "Villagers can have jobs and trade with players for items and emeralds which can become quite valuable to players."
      ]
    },
    {
      "name": "blaze",
      "type": "hostile",
      "hitPoints": 0,
      "spawn": [
        "Blazes spawn in naturally nether fortresses at a light levels <= 11.",
        "Blazes also spawn from Blaze spawners, found in nether fortresses."
      ],
      "drops": [
        "0–1 blaze rods (up to 4 with Looting).",
        "10 exp if killed by player or tamed wolf."
      ],
      "behavior": [
        "Blazes target players within 48 blocks. Upon taking damage, it alerts other blazes within 48 blocks.",
        "Blazes shoot three fireballs at a time, which ignites the player upon contact.",
        "Contacting a player causes a melee attack to occur.",
        "Blazes fly, or float down or stay on the ground when not attacking.",
        "Blazes swim upward in lava or water. Blazes take damage from water but make no attempt to protect themselves from it once in it.",
        "Their pathfinding avoids lava."
      ]
    },
    {
      "name": "creeper",
      "type": "hostile",
      "hitPoints": 20,
      "spawn": [
        "Creepers naturally spawn in the Overworld on solid blocks with a light level <= 7.",
        "Creepers are 1.7 blocks high, allowing them to spawn in 1.8125 block height."
      ],
      "drops": [
        "5 exp when killed by player or tamed wolf",
        "0–2 gunpowder (up to 5 with Looting)",
        "1 music disc (excluding Pigstep), when killed by a skeleton/stray",
        "1 creeper head, when killed by a charged creeper explosion"
      ],
      "behavior": [
        "Creepers chase any player within a 16 block radius and 4 block height.",
        "Detection is reduced by 50% when the player is wearing a creeper head",
        "Creepers start to ignite when a player is in a 3 block radius and explodes after 1.5 seconds.",
        "Using a flint and steel on a creeper forces an explosion.",
        "When a creeper is inflicted with a potion effect, its explosion creates an area effect cloud of the effect.",
        "Creepers flee from ocelots and cats within a 6 block radius.",
        "Creepers struck by lightning turn into charged creepers"
      ]
    },
    {
      "name": "ghast",
      "type": "hostile",
      "hitPoints": 10,
      "spawn": [
        "Ghasts require a solid block below them and a 5×4×5 space to spawn naturally.",
        "Ghasts only spawn in the basalt deltas, nether wastes, at any light level.",
        "In soul sand valleys, ghasts cannot spawn if another ghast is within 16 blocks of spherical distance to the intended spawning location.",
        "Ghasts do not spawn in nether fortresses."
      ],
      "drops": [
        "0-1 Ghast Tear. (up to 4 with Looting)",
        "0-2 gunpowder. (up to 5 with Looting)",
        "5 exp when killed by the player."
      ],
      "behavior": [
        "Ghasts float around the Nether with their eyes and mouth closed and periodically make crying sounds.",
        "Ghasts face the player and shoot a fireball every 3 seconds, opening their eyes and mouth and making a screeching sound.",
        "They target players within 64 blocks horizontally and 4 blocks vertically.",
        "Ghasts continue attacking until players break line of sight or exit a 64 block sphere of the ghast",
        "Ghasts do not have a pursuit mode.",
        "The ghast's fireball attack has a straight trajectory"
      ]
    },
    {
      "name": "magma cube",
      "type": "hostile",
      "hitPoints": 16,
      "spawn": [
        "They are found in the Nether at all light levels.",
        "They spawn in spaces clear of obstructions and liquids.",
        "Only sizes 1, 2, and 4 spawn naturally."
      ],
      "drops": [
        "Large magma cube: 0–1 magma cream and 4 experience",
        "Small magma cube: 0–1 magma cream (0.25 average) and 2 experience",
        "Tiny magma cube: 1 experience",
        "Up to 1.21 magma cream per roll with Looting."
      ],
      "behavior": [
        "A magma cube hops around to move.",
        "A magma cube moves to any player or iron golem within a 16 blocks spherical distance",
        "When a magma cube is killed, it splits into 2-4 smaller magma cubes. Tiny magma cubes disappear when killed.",
        "When in lava, magma cubes hover and try to move to nearby land.",
        "Magma cubes have no pathfinding ability.",
        "Magma cubes attack by hopping and landing on the player, doing damage on contact."
      ]
    },
    {
      "name": "shulker",
      "type": "hostile",
      "hitPoints": 30,
      "spawn": [
        "Shulkers spawn a single time on the walls and end ships of end cities.",
        "There is a chance that a new shulker will spawn when one hits another (or itself) with its bullet."
      ],
      "drops": [
        "Shulkers have a 50% chance of dropping 1 shulker shell (up to 68.75% chance with Looting).",
        "5 exp when killed by player or tamed wolf."
      ],
      "behavior": [
        "Shulkers are passive on Peaceful difficulty.",
        "Shulkers open their shell for 1–3 seconds. When a target comes within ~16 blocks, it opens and shoots homing projectiles.",
        "Shulkers have armor and deflect arrows when closed.",
        "When at less than half health, shulkers have a 25% chance of teleporting.",
        "Their projectiles give 10 seconds of Levitation status effect.",
        "They can be dyed like sheep."
      ]
    },
    {
      "name": "silverfish",
      "type": "hostile",
      "hitPoints": 8,
      "spawn": [
        "Silverfish spawn from broken infested blocks, generated in strongholds, igloo basements, woodland mansion portal rooms, and mountains.",
        "Silverfish do not appear if the block is broken with Silk Touch.",
        "From spawners, they can spawn only in light level <= 11.",
        "They cannot spawn within a 5 block distance of any player from spawners.",
        "Silverfish spawners are found in strongholds."
      ],
      "drops": [
        "5 exp when killed by player or tamed wolf."
      ],
      "behavior": [
        "Silverfish call other silverfish in the area upon being hit, which can see through walls and pathfind to the player.",
        "When idle, silverfish enter a nearby stone/cobblestone/stone bricks/mossy stone bricks/cracked stone bricks/chiseled stone bricks block.",
        "They take more damage from Bane of Arthropods.",
        "Damaging, but not killing a silverfish will cause nearby infested blocks to break open."
      ]
    },
    {
      "name": "skeleton",
      "type": "hostile",
      "hitPoints": 20,
      "spawn": [
        "Skeletons spawn at a light levels <= 7, in groups of 4 or 5 in the Overworld.",
        "80% of skeletons under the sky spawn as strays in snowy tundras and frozen oceans.",
        "Spiders have a 1% chance to spawn with a skeleton, creating a skeleton jockey.",
        "Some spawn in nether fortresses.",
        "Skeletons are common in soul sand valleys."
      ],
      "drops": [
        "5 exp if killed by player or tamed wolf, extra 1-3 if equipped with armor",
        "0-2 bones (up to 5 with Looting)",
        "0-2 arrows (up to 5 with Looting)",
        "Skeleton skull if killed by a charged creeper.",
        "8.5% chance to drop gear/tools they spawn with (up to 11.5% with Looting).",
        "Pumpkin if worn during Halloween."
      ],
      "behavior": [
        "Skeletons chase players they see within 16 blocks",
        "If you leave a 15-block radius, skeletons wait with the bow charged, waiting for re-entry.",
        "The detection range of skeletons is reduced when players wear a skeleton skull"
      ]
    },
    {
      "name": "slime",
      "type": "hostile",
      "hitPoints": 16,
      "spawn": [
        "Slimes spawn in the Overworld in chunks below layer 40.",
        "Slimes also spawn in swamp biomes between layers 50 and 70 in light levels <= 7.",
        "Only sizes 1, 2, and 4 spawn naturally.",
        "Slimes never spawn under a new moon."
      ],
      "drops": [
        "At a slime's smallest size, it drops 0-2 slimeballs (up to 5 with Looting).",
        "Exp matching their size of 1, 2, or 4."
      ],
      "behavior": [
        "Slime hops around to move.",
        "Slime moves to any player or iron golem within a 16 blocks spherical distance",
        "When slime is killed, it splits into 2-4 smaller slimes. Tiny slime disappear when killed.",
        "Slimes try to move out of water.",
        "Slimes do damage proportionate to their size, except for the smallest which do not deal damage.",
        "Slimes attack by hopping toward the player, doing damage on contact."
      ]
    },
    {
      "name": "warden",
      "type": "hostile",
      "hitPoints": 84,
      "spawn": [
        "Wardens spawn in deep dark caves, at the \"deepest depths of the world.\""
      ],
      "drops": [
        "Unknown."
      ],
      "behavior": [
        "Wardens are blind, using sensors to detect vibrations.",
        "Wardens have an exposed heart that flashes.",
        "Its heart flashes more rapidly and deals more damage more quickly as it takes more damage.",
        "Light sources flicker near the warden's presence."
      ]
    },
    {
      "name": "zombie",
      "type": "hostile",
      "hitPoints": 20,
      "spawn": [
        "Zombies spawn in the overworld in up to groups of 4.",
        "Spawns with a light level of 7 or less",
        "Zombies exposed to the sky in deserts have a 70-80% chance become husks.",
        "5% chance to spawn as a zombie villager or baby zombie.",
        "Baby zombies have a 5% chance of spawning as a chicken jockey.",
        "Occasionally spawn with the ability to equip dropped armor and weapons."
      ],
      "drops": [
        "5 exp if killed by player or tamed wolf",
        "0-2 rotten flesh (up to 5 with Looting)",
        "1 iron ingot",
        "1 carrot",
        "1 potato",
        "Gear/tools they spawn with, or have picked up",
        "Pumpkin if worn during Halloween."
      ],
      "behavior": [
        "A zombie will target a player within a 40 block radius.",
        "They will crowd around doors when in pursuit of players and villagers.",
        "They can break down doors in hard mode.",
        "They can turn zombies into zombie villagers.",
        "Several zombies can collaborate and attack as a team (known as a horde)."
      ]
    }
  ]
}
